keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxFlash_bf.h
/** \\brief  Offset for Ifx_FLASH_HSMFCON_Bits.VOPERM */
#define IFX_FLASH_HSMFCON_VOPERM_OFF (24)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.D1BUSY */
#define IFX_FLASH_HSMFSR_D1BUSY_OFF (2)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_OFF (10)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_OFF (8)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_OFF (26)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_OFF (11)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_OFF (7)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_OFF (25)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_OFF (27)

/** \\brief  Length for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_OFF (12)

/** \\brief  Length for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_OFF (1)

/** \\brief  Length for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_OFF (3)

/** \\brief  Length for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_OFF (4)

/** \\brief  Length for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_LEN (29)

/** \\brief  Mask for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_OFF (3)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_OFF (2)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_LEN (16)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_MSK (0xffff)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_OFF (16)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_OFF (3)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_OFF (8)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_OFF (4)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_OFF (1)

/** \\brief  Length for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_LEN (1)

/** \\brief  Mask for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_OFF (0)

/** \\brief  Length for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_LEN (32)

/** \\brief  Mask for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_OFF (0)

