keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxFlash_bf.h
/** \\brief  Length for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_LEN (32)

/** \\brief  Mask for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_OFF (0)

/** \\brief  Length for Ifx_FLASH_ID_Bits.MOD_REV */
#define IFX_FLASH_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_FLASH_ID_Bits.MOD_REV */
#define IFX_FLASH_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_FLASH_ID_Bits.MOD_REV */
#define IFX_FLASH_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_FLASH_ID_Bits.MOD_TYPE */
#define IFX_FLASH_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_OFF (0)

/** \\brief  Length for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_OFF (1)

/** \\brief  Length for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_OFF (3)

/** \\brief  Length for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_OFF (4)

/** \\brief  Length for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_OFF (15)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_OFF (0)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.SELP1 */
#define IFX_FLASH_MARP_SELP1_OFF (1)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.SELP2 */
#define IFX_FLASH_MARP_SELP2_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.SELP2 */
#define IFX_FLASH_MARP_SELP2_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.SELP2 */
#define IFX_FLASH_MARP_SELP2_OFF (2)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.SELP3 */
#define IFX_FLASH_MARP_SELP3_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.SELP3 */
#define IFX_FLASH_MARP_SELP3_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.SELP3 */
#define IFX_FLASH_MARP_SELP3_OFF (3)

/** \\brief  Length for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_OFF (15)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.APREN */
#define IFX_FLASH_PROCOND_APREN_OFF (11)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP0EN */
#define IFX_FLASH_PROCOND_CAP0EN_OFF (12)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP1EN */
#define IFX_FLASH_PROCOND_CAP1EN_OFF (13)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP2EN */
#define IFX_FLASH_PROCOND_CAP2EN_OFF (14)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.CAP3EN */
#define IFX_FLASH_PROCOND_CAP3EN_OFF (15)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_LEN (12)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_MSK (0xfff)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_OFF (16)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_LEN (1)

/** \\brief  Mask for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_OFF (0)

/** \\brief  Length for Ifx_FLASH_PROCOND_Bits.MODE */
#define IFX_FLASH_PROCOND_MODE_LEN (2)

