keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxFlash_bf.h
/** \\brief  Mask for Ifx_FLASH_RRD1_Bits.DATA */
#define IFX_FLASH_RRD1_DATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_FLASH_RRD1_Bits.DATA */
#define IFX_FLASH_RRD1_DATA_OFF (0)

/** \\brief  Length for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.CLR */
#define IFX_FLASH_UBAB_CFG_CLR_OFF (8)

/** \\brief  Length for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.DIS */
#define IFX_FLASH_UBAB_CFG_DIS_OFF (9)

/** \\brief  Length for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_LEN (6)

/** \\brief  Mask for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_UBAB_CFG_Bits.SEL */
#define IFX_FLASH_UBAB_CFG_SEL_OFF (0)

/** \\brief  Length for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_UBAB_STAT_VLD0_OFF (0)

/** \\brief  Length for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_LEN (19)

/** \\brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_MSK (0x7ffff)

/** \\brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.ADDR */
#define IFX_FLASH_UBAB_TOP_ADDR_OFF (5)

/** \\brief  Length for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.CLR */
#define IFX_FLASH_UBAB_TOP_CLR_OFF (31)

/** \\brief  Length for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_LEN (6)

/** \\brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_MSK (0x3f)

/** \\brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.ERR */
#define IFX_FLASH_UBAB_TOP_ERR_OFF (24)

/** \\brief  Length for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_LEN (1)

/** \\brief  Mask for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_MSK (0x1)

/** \\brief  Offset for Ifx_FLASH_UBAB_TOP_Bits.VLD */
#define IFX_FLASH_UBAB_TOP_VLD_OFF (30)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXFLASH_BF_H */
